Public Attributes | List of all members
API_CWAccessoryQuantity Struct Reference
Element Manager
Describes the different calculated values for curtain wall accessories. More...
#include <APIdefs_Elements.h>
 Public Attributes
 GS::uchar_t  | typeText [API_UniLongNameLen]
Name of the GDL object.
 double  | width
Width of the accessory.
 double  | height
Height of the acccessory.
 double  | length
Length of the accessory. (It's equal to the frame length belongs to plus offset value stored in GDL)
 double  | filler [4]
Reserved for later use.
Detailed Description
Describes the different calculated values for curtain wall accessories.
Remarks
See also the curtain wall accessory description in Appendix A of the GDL Reference manual.